_posts/2015-05-24-a-simple-web-app-in-rust-pt-1.org
---
layout: post
title: A Simple Web App in Rust, Part 1
---
* Intro & Background
What is it like to write a tiny web app in Rust from
the perspective of an experienced programmer who is new to the ecosystem?
Read on to find out.

I've been interested in Rust since I first heard about it. A systems
language that supports macros & has room to grow towards higher-level
abstractions? Awesome.

So far, I have only written read blog posts about Rust & done some
very basic "hello world" style programs. So, I guess I'm saying that
my perspective is pretty raw.

A while back I saw [[http://artyom.me/learning-racket-1][this article]] about learning Racket, and I thought
it was really great. We need more people writing about their
experiences as beginners with a technology, especially those who
already have a fair amount of experience with
technology [fn:experience]. I also liked its stream-of-consciousness
approach, and think it would be a nice experiment to write one for
Rust.

So, with the preliminaries out of the way, let's get started.

[fn:experience] I'm not trying to say that the experiences of
beginners is not valuable -- far from it! However, I do think those
experiences bring a separate set of insights than those from someone
who has been programming for a long time, and they may notice how
non-standard some things in an ecosystem are.


* The App
The app I want to build serves a simple need of mine: A
brain-dead-easy way to record when I take my medication each day. I
want tap a link on my home screen and have it record the visit, and
this will preserve a record of when I've taken my medication.

Rust seems to be suited for this app. It's fast. Running a single,
simple server takes relatively
few resources, so it won't be taxing to my VPS. And, I have wanted to
do something more real with Rust.

The MVP is very small, but there room for it to grow if I want to add
more features. Sounds perfect.
* The Plan
So, I'm going to quickly admit something here: I lost an earlier
version of this project. This has some disadvantages: as I recreate
this, I won't have the same level of unfamiliarity I did when I
approached it some weeks ago. However, I think I remember those pain
points, and will do my best to recreate them.

However, there is one thing that I learned that I want to apply here:
it is much easier to build separate, individual programs while
exploring APIs instead of trying to do everything all at once.

To that end, I have the following plan:
1. Build a simple web server that displays "hello world" when I
   visit.
2. Build a tiny program that logs the formatted date and time whenever
   it is run.
3. Integrate the two into a single application.
4. Deploy this application to my server, a Digital Ocean VPS.
* Writing The "Hello World" Web App

So, I'm starting an empty git repo & have homebrew installed. Lets
install Rust. I know this much, at least.
** Installing Rust
#+BEGIN_SRC
$ brew update
...
$ brew install rust
==> Downloading https://homebrew.bintray.com/bottles/rust-1.0.0.yosemite.bottle.tar.gz
############################################################################################# 100.0%
==> Pouring rust-1.0.0.yosemite.bottle.tar.gz
==> Caveats
Bash completion has been installed to:
  /usr/local/etc/bash_completion.d

zsh completion has been installed to:
  /usr/local/share/zsh/site-functions
==> Summary
ðŸº  /usr/local/Cellar/rust/1.0.0: 13947 files, 353M
#+END_SRC


Oook, before anything else, lets do a regular "hello world" program.


#+BEGIN_SRC
$ cat > hello_world.rs
fn main() {

        println!("hello world");
}
^D
$ rustc hello_world.rs
$ ./hello_world
hello world
$
#+END_SRC

So far, so good. Rust is working! Or, at least, the compiler is.

A friend suggested I try [[http://nickel.rs/][nickle.rs]] as a web application framework for
Rust. It looks good to me!

As of today, the first example it uses is:

#+BEGIN_SRC
#[macro_use] extern crate nickel;

use nickel::Nickel;

fn main() {
    let mut server = Nickel::new();

    server.utilize(router! {
        get "**" => |_req, _res| {
            "Hello world!"
        }
    });

    server.listen("127.0.0.1:6767");
}
#+END_SRC

So, the first time I did this, I got a little side tracked and learned
a bit about cargo. This time, I notice that there's this
[[http://nickel.rs/getting-started.html]["getting started" link]], so I think I'll try that instead of getting
everything set up on my own.

There's a script that I'm supposed to ~curl~ and pipe into a root
shell, but that makes me paranoid so I'm going to download it and look
over it first.

#+BEGIN_SRC
curl -LO https://static.rust-lang.org/rustup.sh
#+END_SRC


Ok, this actually doesn't look like its going to do what I want. At
least, there's a lot going on in this script, more than I want to deal
with right now. Hmm. I /wonder/ if ~cargo~ got installed with ~rustc~?

#+BEGIN_SRC
$ which cargo
/usr/local/bin/cargo
$ cargo -v
Rust's package manager

Usage:
    cargo <command> [<args>...]
    cargo [options]

Options:
    -h, --help       Display this message
    -V, --version    Print version info and exit
    --list           List installed commands
    -v, --verbose    Use verbose output

Some common cargo commands are:
    build       Compile the current project
    clean       Remove the target directory
    doc         Build this project's and its dependencies' documentation
    new         Create a new cargo project
    run         Build and execute src/main.rs
    test        Run the tests
    bench       Run the benchmarks
    update      Update dependencies listed in Cargo.lock
    search      Search registry for crates

See 'cargo help <command>' for more information on a specific command.
#+END_SRC

Ok, that looks good I guess? I'll go with it for now.

#+BEGIN_SRC
$ rm rustup.sh
#+END_SRC

