entries/a-simple-web-app-in-rust-pt-1/index.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>A Simple Web App in Rust, Part 1</title>
    <meta name="viewport" content="width=device-width">
    <meta name="description" content="My personal place to write about the things I find interesting. Programming, Lisp, Ruby, Emacs, etc.">
    <link rel="canonical" href="http://joelmccracken.github.io/entries/a-simple-web-app-in-rust-pt-1/">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/main.css">

</head>

    <body>

    <header class="site-header">

  <div class="wrap">

    <a class="site-title" href="/">Joel's Journal</a>

    <nav class="site-nav">
      <a href="#" class="menu-icon">
        <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
           viewBox="0 0 18 15" enable-background="new 0 0 18 15" xml:space="preserve">
          <path fill="#505050" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0
            h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
          <path fill="#505050" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484
            h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
          <path fill="#505050" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0
            c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
        </svg>
      </a>
      <div class="trigger">
        <a class="page-link" href="/about">About</a>
        <a class="page-link" href="/projects">Projects</a>
      </div>
    </nav>

  </div>

</header>

    <div class="page-content">
      <div class="wrap">
      <div class="post">

  <header class="post-header">
    <h1>A Simple Web App in Rust, Part 1</h1>
    <p class="meta">May 24, 2015</p>
  </header>

  <article class="post-content">
  <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Intro &amp; Background</a></li>
<li><a href="#sec-2">2. The App</a></li>
<li><a href="#sec-3">3. The Plan</a></li>
<li><a href="#sec-4">4. Writing The "Hello World" Web App</a>
<ul>
<li><a href="#sec-4-1">4.1. Installing Rust</a></li>
<li><a href="#sec-4-2">4.2. Setting Up the Project</a></li>
<li><a href="#sec-4-3">4.3. The "Hello World" Example Running</a></li>
<li><a href="#sec-4-4">4.4. One Final Challenge</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro &amp; Background</h2>
<div class="outline-text-2" id="text-1">
<p>
What is it like to write a tiny web app in Rust from
the perspective of an experienced programmer who is new to the ecosystem?
Read on to find out.
</p>

<p>
I've been interested in Rust since I first heard about it. A systems
language that supports macros &amp; has room to grow towards higher-level
abstractions? Awesome.
</p>

<p>
So far, I have only written read blog posts about Rust &amp; done some
very basic "hello world" style programs. So, I guess I'm saying that
my perspective is pretty raw.
</p>

<p>
A while back I saw <a href="http://artyom.me/learning-racket-1">this article</a> about learning Racket, and I thought
it was really great. We need more people writing about their
experiences as beginners with a technology, especially those who
already have a fair amount of experience with
technology <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. I also liked its stream-of-consciousness
approach, and think it would be a nice experiment to write one for
Rust.
</p>

<p>
So, with the preliminaries out of the way, let's get started.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The App</h2>
<div class="outline-text-2" id="text-2">
<p>
The app I want to build serves a simple need of mine: A
brain-dead-easy way to record when I take my medication each day. I
want tap a link on my home screen and have it record the visit, and
this will preserve a record of when I've taken my medication.
</p>

<p>
Rust seems to be suited for this app. It's fast. Running a single,
simple server takes relatively
few resources, so it won't be taxing to my VPS. And, I have wanted to
do something more real with Rust.
</p>

<p>
The MVP is very small, but there room for it to grow if I want to add
more features. Sounds perfect.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Plan</h2>
<div class="outline-text-2" id="text-3">
<p>
So, I'm going to quickly admit something here: I lost an earlier
version of this project. This has some disadvantages: as I recreate
this, I won't have the same level of unfamiliarity I did when I
approached it some weeks ago. However, I think I remember those pain
points, and will do my best to recreate them.
</p>

<p>
However, there is one thing that I learned that I want to apply here:
it is much easier to build separate, individual programs while
exploring APIs instead of trying to do everything all at once.
</p>

<p>
To that end, I have the following plan:
</p>
<ol class="org-ol">
<li>Build a simple web server that displays "hello world" when I
visit.
</li>
<li>Build a tiny program that logs the formatted date and time whenever
it is run.
</li>
<li>Integrate the two into a single application.
</li>
<li>Deploy this application to my server, a Digital Ocean VPS.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Writing The "Hello World" Web App</h2>
<div class="outline-text-2" id="text-4">
<p>
So, I'm starting an empty git repo &amp; have homebrew installed. Lets
install Rust. I know this much, at least.
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Installing Rust</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
$ brew update
...
$ brew install rust
==&gt; Downloading https://homebrew.bintray.com/bottles/rust-1.0.0.yosemite.bottle.tar.gz
############################################################################################# 100.0%
==&gt; Pouring rust-1.0.0.yosemite.bottle.tar.gz
==&gt; Caveats
Bash completion has been installed to:
  /usr/local/etc/bash_completion.d

zsh completion has been installed to:
  /usr/local/share/zsh/site-functions
==&gt; Summary
🍺  /usr/local/Cellar/rust/1.0.0: 13947 files, 353M
</pre>


<p>
Oook, before anything else, lets do a regular "hello world" program.
</p>


<pre class="example">
$ cat &gt; hello_world.rs
fn main() {

        println!("hello world");
}
^D
$ rustc hello_world.rs
$ ./hello_world
hello world
$
</pre>

<p>
So far, so good. Rust is working! Or, at least, the compiler is.
</p>

<p>
A friend suggested I try <a href="http://nickel.rs/">nickle.rs</a> as a web application framework for
Rust. It looks good to me!
</p>

<p>
As of today, the first example it uses is:
</p>

<pre class="example">
#[macro_use] extern crate nickel;

use nickel::Nickel;

fn main() {
    let mut server = Nickel::new();

    server.utilize(router! {
        get "**" =&gt; |_req, _res| {
            "Hello world!"
        }
    });

    server.listen("127.0.0.1:6767");
}
</pre>

<p>
So, the first time I did this, I got a little side tracked and learned
a bit about cargo. This time, I notice that there's this
<a href="http://nickel.rs/getting-started.html">"getting started" link</a>, so I think I'll try that instead of getting
everything set up on my own.
</p>

<p>
There's a script that I'm supposed to <code>curl</code> and pipe into a root
shell, but that makes me paranoid so I'm going to download it and look
over it first.
</p>

<pre class="example">
curl -LO https://static.rust-lang.org/rustup.sh
</pre>


<p>
Ok, this actually doesn't look like its going to do what I want. At
least, there's a lot going on in this script, more than I want to deal
with right now. Hmm. I <i>wonder</i> if <code>cargo</code> got installed with <code>rustc</code>?
</p>

<pre class="example">
$ which cargo
/usr/local/bin/cargo
$ cargo -v
Rust's package manager

Usage:
    cargo &lt;command&gt; [&lt;args&gt;...]
    cargo [options]

Options:
    -h, --help       Display this message
    -V, --version    Print version info and exit
    --list           List installed commands
    -v, --verbose    Use verbose output

Some common cargo commands are:
    build       Compile the current project
    clean       Remove the target directory
    doc         Build this project's and its dependencies' documentation
    new         Create a new cargo project
    run         Build and execute src/main.rs
    test        Run the tests
    bench       Run the benchmarks
    update      Update dependencies listed in Cargo.lock
    search      Search registry for crates

See 'cargo help &lt;command&gt;' for more information on a specific command.
</pre>

<p>
Ok, that looks good I guess? I'll go with it for now.
</p>

<pre class="example">
$ rm rustup.sh
</pre>
</div>
</div>
