_posts/2015-05-24-a-simple-web-app-in-rust-pt-1.org
** Setting Up the Project

So, the next step is to generate a new project directory. But I
already have a project directory =(. I'll try it like this, anyway.

#+BEGIN_SRC
$ cargo new . --bin
Destination `/Users/joel/Projects/simplelog/.` already exists
#+END_SRC

Ugh, that didn't work.

#+BEGIN_SRC
$ cargo -h
Create a new cargo package at <path>

Usage:
    cargo new [options] <path>
    cargo new -h | --help

Options:
    -h, --help          Print this message
    --vcs <vcs>         Initialize a new repository for the given version
                        control system (git or hg) or do not initialize any version
                        control at all (none) overriding a global configuration.
    --bin               Use a binary instead of a library template
    --name <name>       Set the resulting package name
    -v, --verbose       Use verbose output

#+END_SRC

Yeah, it doesn't look like this is going to do what I want it to. Blah
I guess I'll just redo this repo.

#+BEGIN_SRC
$ cd ../
$ rm -rf simplelog/
$ cargo new simple-log --bin
$ cd simple-log/
#+END_SRC


Ok, what's up in here?

#+BEGIN_SRC
$ tree
.
|____.git
| |____config
| |____description
| |____HEAD
| |____hooks
| | |____README.sample
| |____info
| | |____exclude
| |____objects
| | |____info
| | |____pack
| |____refs
| | |____heads
| | |____tags
|____.gitignore
|____Cargo.toml
|____src
| |____main.rs
#+END_SRC

So, it made a git repository, ~Cargo.toml~ and a ~main.rs~ in a ~src~
directory. Sounds fine to me.

Next on the nickel getting started page,
I add the ~nickel.rs~ dependency to the cargo file, and it now looks
like:

#+BEGIN_SRC
[package]
name = "simple-log"
version = "0.1.0"
authors = ["Joel McCracken <mccracken.joel@gmail.com>"]

[dependencies.nickel]

git = "https://github.com/nickel-org/nickel.rs.git"

#+END_SRC

This makes sense, I think. I'm not sure what
"dependencies.nickel" is actually /saying/. Is ~dependencies~ a hash
with a ~nickel~ key? I do get that I'm saying "get nickel from here,
yo".

** The "Hello World" Example Running

Anyway, moving on and pasting the example into ~main.rs~:

#+BEGIN_SRC
#[macro_use] extern crate nickel;

use nickel::Nickel;

fn main() {
    let mut server = Nickel::new();

    server.utilize(router! {
        get "**" => |_req, _res| {
            "Hello world!"
        }
    });

    server.listen("127.0.0.1:6767");
}

#+END_SRC

So, what's the deal with ~macro_use~, ~extern~, and then needing to
~use~? All stuff I will figure out later.

/Oh snap/, I had a few sentences about how ~macro_use~ was probably a
macro-time directive[fn:macro-time], but I didn't see any actual
macros, so I deleted it. Now I see ~router!~, though, so I'm even more
inclined to think this is a macro directive. Also, I doubt
the term 'directive' is correct, so don't pick it up.

Lets try it:
#+BEGIN_SRC
cargo run
    Updating git repository `https://github.com/nickel-org/nickel.rs.git`
    Updating registry `https://github.com/rust-lang/crates.io-index`
 Downloading unsafe-any v0.4.1
 Downloading httparse v0.1.2
 Downloading traitobject v0.0.3
 Downloading lazy_static v0.1.10
 Downloading pkg-config v0.3.4
 Downloading num_cpus v0.2.5
 Downloading modifier v0.1.0
 Downloading groupable v0.2.0
 Downloading unicase v0.1.0
 Downloading gcc v0.3.5
 Downloading time v0.1.25
 Downloading log v0.3.1
 Downloading url v0.2.34
 Downloading plugin v0.2.6
 Downloading hyper v0.4.0
 Downloading matches v0.1.2
 Downloading mustache v0.6.1
 Downloading bitflags v0.1.1
 Downloading typeable v0.1.1
 Downloading openssl v0.6.2
 Downloading rustc-serialize v0.3.14
 Downloading typemap v0.3.2
 Downloading regex v0.1.30
 Downloading cookie v0.1.20
 Downloading mime v0.0.11
 Downloading libc v0.1.8
 Downloading openssl-sys v0.6.2
   Compiling modifier v0.1.0
   Compiling traitobject v0.0.3
   Compiling regex v0.1.30
   Compiling libc v0.1.8
   Compiling lazy_static v0.1.10
   Compiling matches v0.1.2
   Compiling httparse v0.1.2
   Compiling rustc-serialize v0.3.14
   Compiling groupable v0.2.0
   Compiling pkg-config v0.3.4
   Compiling gcc v0.3.5
   Compiling bitflags v0.1.1
   Compiling unicase v0.1.0
   Compiling typeable v0.1.1
   Compiling unsafe-any v0.4.1
   Compiling log v0.3.1
   Compiling num_cpus v0.2.5
   Compiling typemap v0.3.2
   Compiling mime v0.0.11
   Compiling plugin v0.2.6
   Compiling openssl-sys v0.6.2
   Compiling time v0.1.25
   Compiling openssl v0.6.2
   Compiling url v0.2.34
   Compiling mustache v0.6.1
   Compiling cookie v0.1.20
   Compiling hyper v0.4.0
   Compiling nickel v0.5.0 (https://github.com/nickel-org/nickel.rs.git#69546f58)
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `target/debug/simple-log`
Listening on http://127.0.0.1:6767
Ctrl-C to shutdown server
^C
#+END_SRC

Woo hoo! Visiting ~localhost:6767~ in my browser worked.


[fn:macro-time] I would normally say
'compile-time' directive, but that doesn't make much sense since Rust
is a compiled language. So, I say 'macro-time' directive, but I really
have no idea.

