entries/a-simple-web-app-in-rust-pt-1/index.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Setting Up the Project</h3>
<div class="outline-text-3" id="text-4-2">
<p>
So, the next step is to generate a new project directory. But I
already have a project directory =(. I'll try it like this, anyway.
</p>

<pre class="example">
$ cargo new . --bin
Destination `/Users/joel/Projects/simplelog/.` already exists
</pre>

<p>
Ugh, that didn't work.
</p>

<pre class="example">
$ cargo -h
Create a new cargo package at &lt;path&gt;

Usage:
    cargo new [options] &lt;path&gt;
    cargo new -h | --help

Options:
    -h, --help          Print this message
    --vcs &lt;vcs&gt;         Initialize a new repository for the given version
                        control system (git or hg) or do not initialize any version
                        control at all (none) overriding a global configuration.
    --bin               Use a binary instead of a library template
    --name &lt;name&gt;       Set the resulting package name
    -v, --verbose       Use verbose output
</pre>

<p>
Yeah, it doesn't look like this is going to do what I want it to. Blah
I guess I'll just redo this repo.
</p>

<pre class="example">
$ cd ../
$ rm -rf simplelog/
$ cargo new simple-log --bin
$ cd simple-log/
</pre>


<p>
Ok, what's up in here?
</p>

<pre class="example">
$ tree
.
|____.git
| |____config
| |____description
| |____HEAD
| |____hooks
| | |____README.sample
| |____info
| | |____exclude
| |____objects
| | |____info
| | |____pack
| |____refs
| | |____heads
| | |____tags
|____.gitignore
|____Cargo.toml
|____src
| |____main.rs
</pre>

<p>
So, it made a git repository, <code>Cargo.toml</code> and a <code>main.rs</code> in a <code>src</code>
directory. Sounds fine to me.
</p>

<p>
Next on the nickel getting started page,
I add the <code>nickel.rs</code> dependency to the cargo file, and it now looks
like:
</p>

<pre class="example">
[package]
name = "simple-log"
version = "0.1.0"
authors = ["Joel McCracken &lt;mccracken.joel@gmail.com&gt;"]

[dependencies.nickel]

git = "https://github.com/nickel-org/nickel.rs.git"
</pre>

<p>
This makes sense, I think. I'm not sure what
"dependencies.nickel" is actually <i>saying</i>. Is <code>dependencies</code> a hash
with a <code>nickel</code> key? I do get that I'm saying "get nickel from here,
yo".
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> The "Hello World" Example Running</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Anyway, moving on and pasting the example into <code>main.rs</code>:
</p>

<pre class="example">
#[macro_use] extern crate nickel;

use nickel::Nickel;

fn main() {
    let mut server = Nickel::new();

    server.utilize(router! {
        get "**" =&gt; |_req, _res| {
            "Hello world!"
        }
    });

    server.listen("127.0.0.1:6767");
}
</pre>

<p>
So, what's the deal with <code>macro_use</code>, <code>extern</code>, and then needing to
<code>use</code>? All stuff I will figure out later.
</p>

<p>
<i>Oh snap</i>, I had a few sentences about how <code>macro_use</code> was probably a
macro-time directive<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>, but I didn't see any actual
macros, so I deleted it. Now I see <code>router!</code>, though, so I'm even more
inclined to think this is a macro directive. Also, I doubt
the term 'directive' is correct, so don't pick it up.
</p>

<p>
Lets try it:
</p>
<pre class="example">
cargo run
    Updating git repository `https://github.com/nickel-org/nickel.rs.git`
    Updating registry `https://github.com/rust-lang/crates.io-index`
 Downloading unsafe-any v0.4.1
 Downloading httparse v0.1.2
 Downloading traitobject v0.0.3
 Downloading lazy_static v0.1.10
 Downloading pkg-config v0.3.4
 Downloading num_cpus v0.2.5
 Downloading modifier v0.1.0
 Downloading groupable v0.2.0
 Downloading unicase v0.1.0
 Downloading gcc v0.3.5
 Downloading time v0.1.25
 Downloading log v0.3.1
 Downloading url v0.2.34
 Downloading plugin v0.2.6
 Downloading hyper v0.4.0
 Downloading matches v0.1.2
 Downloading mustache v0.6.1
 Downloading bitflags v0.1.1
 Downloading typeable v0.1.1
 Downloading openssl v0.6.2
 Downloading rustc-serialize v0.3.14
 Downloading typemap v0.3.2
 Downloading regex v0.1.30
 Downloading cookie v0.1.20
 Downloading mime v0.0.11
 Downloading libc v0.1.8
 Downloading openssl-sys v0.6.2
   Compiling modifier v0.1.0
   Compiling traitobject v0.0.3
   Compiling regex v0.1.30
   Compiling libc v0.1.8
   Compiling lazy_static v0.1.10
   Compiling matches v0.1.2
   Compiling httparse v0.1.2
   Compiling rustc-serialize v0.3.14
   Compiling groupable v0.2.0
   Compiling pkg-config v0.3.4
   Compiling gcc v0.3.5
   Compiling bitflags v0.1.1
   Compiling unicase v0.1.0
   Compiling typeable v0.1.1
   Compiling unsafe-any v0.4.1
   Compiling log v0.3.1
   Compiling num_cpus v0.2.5
   Compiling typemap v0.3.2
   Compiling mime v0.0.11
   Compiling plugin v0.2.6
   Compiling openssl-sys v0.6.2
   Compiling time v0.1.25
   Compiling openssl v0.6.2
   Compiling url v0.2.34
   Compiling mustache v0.6.1
   Compiling cookie v0.1.20
   Compiling hyper v0.4.0
   Compiling nickel v0.5.0 (https://github.com/nickel-org/nickel.rs.git#69546f58)
   Compiling simple-log v0.1.0 (file:///Users/joel/Projects/simple-log)
     Running `target/debug/simple-log`
Listening on http://127.0.0.1:6767
Ctrl-C to shutdown server
^C
</pre>

<p>
Woo hoo! Visiting <code>localhost:6767</code> in my browser worked.
</p>
</div>
</div>
